In [48]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (2.2.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.26.0 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [49]:
import pandas as pd

In [50]:
data = {
    'Name' : ['Sarah', 'Sandra', 'Nekotina', 'Nekotina', 'Nekotina', 'Nekotina'],
    'Age': [20, 30, 666, 10, 10, 777]
}

data

{'Name': ['Sarah', 'Sandra', 'Nekotina', 'Nekotina', 'Nekotina', 'Nekotina'],
 'Age': [20, 30, 666, 10, 10, 777]}

In [51]:
df = pd.DataFrame(data)
df

       Name  Age
0     Sarah   20
1    Sandra   30
2  Nekotina  666
3  Nekotina   10
4  Nekotina   10
5  Nekotina  777

In [52]:
# series (they're like lists):

df["Age"]

0     20
1     30
2    666
3     10
4     10
5    777
Name: Age, dtype: int64

In [53]:
df["Name"]

0       Sarah
1      Sandra
2    Nekotina
3    Nekotina
4    Nekotina
5    Nekotina
Name: Name, dtype: object

In [54]:
# los filtros tienen una sintaxis muy inusual!
# te da los que cumplen, pero solo en la columna usada. el resultado es una serie

df["Age"] > 20

0    False
1     True
2     True
3    False
4    False
5     True
Name: Age, dtype: bool

In [55]:
# entonces pues lo guardas, y lo puedes usar
# al meter el filtro guardado en el dataframe, el resultado booleano se mete en "mostrar???"
# y se muestran todos los datos de los que salieron true en el filtro

mayores_japon = df["Age"] > 20

df[mayores_japon]

       Name  Age
1    Sandra   30
2  Nekotina  666
5  Nekotina  777

In [56]:
# agrupemos las nekotinas repetidas, pero qué hacemos con sus edades?
# pues las promediamos
# otros enums son 'max', 'min', y así

df.groupby("Name").agg(
    {
        'Age': 'mean'
    }
)

             Age
Name
Nekotina  365.75
Sandra     30.00
Sarah      20.00

In [57]:
# en los groupby, el parámetro queda como índice!

max_edades = df.groupby("Name").agg(
    {
        'Age': 'max'
    }
)

max_edades

          Age
Name
Nekotina  777
Sandra     30
Sarah      20

In [58]:
print(df.index)             # index rango numérico
print(max_edades.index)     # index nombres del groupby

RangeIndex(start=0, stop=6, step=1)
Index(['Nekotina', 'Sandra', 'Sarah'], dtype='object', name='Name')

In [59]:
# pero puedes resetear ese index para que vuelvan a ser números
# aunque se perderán entradas del df original, en este caso sólo quedaron los mayores

max_edades.reset_index()

       Name  Age
0  Nekotina  777
1    Sandra   30
2     Sarah   20

In [60]:
# puedes borrar las entradas EXACTAMENTE IGUALES con drop_duplicates()
# eliminamos la segunda nekotina de 10 años
# aunque mira que quedaron los index viejos

df.drop_duplicates()

       Name  Age
0     Sarah   20
1    Sandra   30
2  Nekotina  666
3  Nekotina   10
5  Nekotina  777

In [61]:
# si los reinicias, hay una columna con los viejos

df.drop_duplicates().reset_index()

   index      Name  Age
0      0     Sarah   20
1      1    Sandra   30
2      2  Nekotina  666
3      3  Nekotina   10
4      5  Nekotina  777

In [ ]:
# puedes borrar esa columna
# (nada de esto sobreescribe, menos mal. Tienes que hacer el df = ...  para eso)

df.drop_duplicates().reset_index(drop = True)

       Name  Age
0     Sarah   20
1    Sandra   30
2  Nekotina  666
3  Nekotina   10
4  Nekotina  777

In [68]:
# y agregar otra columna

df["Gender"] = ['Woman', 'Man', 'Woman', 'Man', 'Man', "Woman"]
df

       Name  Age Gender
0     Sarah   20  Woman
1    Sandra   30    Man
2  Nekotina  666  Woman
3  Nekotina   10    Man
4  Nekotina   10    Man
5  Nekotina  777  Woman